# 1.Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого
# элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а
# указать явно, в программе.

my_list = ['hi', 45, ['sun', 789], True]

for el in my_list:
    print(el, '-', type(el))
